{
  "nodes":[
    {"name": "Anchorman 2", "img": "images/clapboardRed.png", "info": "\"Anchorman 2,\" or \"Anchorman: The Legend Continues\" filmed recently in Atlanta and brought a number of stars to the area including Kristen Wiig, Harrison Ford, Jim Carrey, Steve Carell, Will Ferrell, Liam Neeson, Nicole Kidman, Kirsten Dunst, Paul  Rudd, Sacha Baron Cohen, James Marsden, Vince Vaughn, Christina Applegate, and Tina Fey.", "imdb": "title/tt1229340"},
    {"name": "The Watch", "img": "images/clapboardRed.png", "info": "\"The Watch,\" released last year, filmed in Atlanta, Marietta, Powder Springs, and various other locations in Georgia. The film stars Ben Stiller, Vince Vaughn, Jonah Hill, and Richard Ayoade.", "imdb": "title/tt1298649"},
    {"name": "Wanderlust", "img": "images/clapboardRed.png", "info": "\"Wanderlust\" was released last year and stars Jennifer Aniston and Paul Rudd. Georgia filming locations include Atlanta, Clarkesville, Lawrenceville, and Monroe.", "imdb": "title/tt1655460"},
    {"name": "The Internship", "img": "images/clapboardRed.png", "info": "\"The Internship,\" which opened this June, was partially filmed at Georgia Tech and a few other Atlanta locations. Vince Vaughn and Owen Wilson star in the film.", "imdb": "title/tt2234155"},
    {"name": "Temptation: Confessions...", "img": "images/clapboardRed.png", "info": "\"Temptation: Confessions of a Marriage Counselor,\" was written and directed by Tyler Perry and released this year. The film stars Jurnee Smollett-Bell, Kim Kardashian and Vanessa Williams. \"Temptation\" was filmed in Atlanta.", "imdb": "title/tt2070862"},
    {"name": "Argo", "img": "images/clapboardRed.png", "info": "\"Argo,\" which won a best-picture Oscar, featured former President Jimmy Carter in a voice-over role that was recorded in Georgia. Ben Afflect starred in and produced \"Argo.\"", "imdb": "title/tt1024648"},
    {"name": "The Odd Life of Timothy Green", "img": "images/clapboardRed.png", "info": "\"The Odd Life of Timothy Green\" stars Jennifer Garner and Joel Edgerton and was released in 2012. Georgia filming locations included Albany, Atlanta, Canton, Dawson, Decatur, Newnan, and the Birmingham United Methodist Church in Alpharetta.", "imdb": "title/tt1462769"},
    {"name": "Lawless", "img": "images/clapboardRed.png", "info": "\"Lawless\" was released last year and was filmed in Woodbury, Coweta County, Gay and LaGrange. Film stars include Shia LaBeouf, Tom Hardy, Jason Clarke, Guy Pearce, Jessica Chastain, Mia Wasikowski.", "imdb": "title/tt1212450"},
    {"name": "Trouble with the Curve", "img": "images/clapboardRed.png", "info": "\"Trouble with the Curve\" stars Clint Eastwood, Amy Adams, Justin Timberlake, and John Goodman. The film was released last year and was filmed in Macon, Dawsonville, Atlanta, Young Harris, Athens, Dunwoody and Jasper. Some specific locations include Dunwoody High School, Luther Williams Field in Macon, and Turner Field in Atlanta.", "imdb": "title/tt2083383"},
    {"name": "Bridesmaids", "img": "images/clapboardRed.png", "info": "\"Bridesmaids\" was not filmed in Georgia, but connects actresses Kristen Wiig and Melissa McCarthy, who both recently filmed movies in Georgia. The film was released in 2011.", "imdb": "title/tt1478338"},
    {"name": "Identity Theif", "img": "images/clapboardRed.png", "info": "\"Identity Thief,\" released earlier this year, stars Jason Bateman and Melissa McCarthy. Most filming took place in Atlanta, and both The Colonnade Restaurant and the Cheshire Motor in are featured in the film.", "imdb": "title/tt2024432"},
    {"name": "The Change-Up", "img": "images/clapboardRed.png", "info": "\"The Change-Up,\" starring Ryan Reynolds, Jason Bateman, and Olivia Wilde, was released in 2011 and filmed entirely in Georgia. Filming locations include Alpharetta, Atlanta, and Turner Field in Atlanta.", "imdb": "title/tt1488555"},
    {"name": "Hall Pass", "img": "images/clapboardRed.png", "info": "\"Hall Pass\" was filmed in Atlanta, Cumming, Gainesville and Johns Creek. Specific filming locations include Druid Hills Golf Club, Peachtree Hills Park, and The Pool Hall, all in Atlanta. The film stars Owen Wilson, Jason Sudeikis, Jenna Fischer and Christina Applegate, and was released in 2011.", "imdb": "title/tt0480687"},
    
    {"name": "Vince Vaughn", "img": "images/vaughn.jpg", "info": "Vince Vaughn appeared in \"The Watch,\" \"The Internship\" and \"Anchorman 2.\"", "imdb": "name/nm0000681"},
      {"name": "Ben Stiller", "img": "images/stiller.jpg", "info": "Ben Stiller appeared in \"The Watch,\" which also starred Vince Vaughn who appeared in Anchorman 2. ", "imdb": "name/nm0001774"},
      {"name": "Jonah Hill", "img": "images/hill.jpg", "info": "Jonah Hill appeared in \"The Watch,\" which also starred Vince Vaughn who appeared in Anchorman 2.", "imdb": "name/nm1706767"},
      {"name": "Richard Ayoade", "img": "images/ayoade.jpg", "info": "Richard Ayoade appeared in \"The Watch,\" which also starred Vince Vaughn who appeared in Anchorman 2. ", "imdb": "name/nm1547964"},
      {"name": "Owen Wilson", "size": 3938, "img": "images/wilson.jpg", "info": "Owen Wilson appeared in \"Hall Pass\" and \"The Internship.\" This connects him to Vince Vaughn, will Ferrell and Christina Applegate, who both starred in \"Anchorman 2.\"", "imdb": "name/nm0005562"},
      {"name": "John Goodman", "size": 3938, "img": "images/goodman.jpg", "info": "John Goodman appeared in \"Trouble With the Curve,\" \"The Internship\" and in \"Flight,\" with Denzel Washington. Through \"The Internship,\" he is connected to Vince Vaughn and Will Ferrell who both starred in \"Anchorman 2.\"", "imdb": "name/nm0000422"},
        {"name": "Ben Affleck", "size": 3938, "img": "images/affleck.jpg", "info": "Ben Affleck accompanied his wife Jennifer Garner to Atlanta when she was here filming \"The Odd Life of Timothy Green.\" He produced and starred in \"Argo.\" Through \"Argo,\" he is connected to John Goodman, who is connected to Vince Vaughn and Will Ferrell, and therefore \"Anchorman 2.\"", "imdb": "name/nm0000255"},
          {"name": "Jennifer Garner", "size": 3938, "img": "images/garner.jpg", "info": "Jennifer Garner appeared in \"The Odd Life of Timothy Green\" with Joel Edgerton. She is married to Ben Affleck who is connected to John Goodman, who is connected to Vince Vaughn and Will Ferrell who star in \"Anchorman 2.\"", "imdb": "name/nm0004950"},
            {"name": "Joel Edgerton", "size": 3938, "img": "images/edgerton.jpg", "info": "Edgerton appeared in \"Zero Dark Thirty\" with Jason Clarke and Jessica Chastain, and also in \"The Odd Life of Timothy Green\" with Jennifer Garner. Through Garner, he is connected to \"Anchorman 2\" by Ben Affleck to John Goodman to Vince Vaughn and Will Ferrell.", "imdb": "name/nm0249291"},
              {"name": "Jason Clarke", "size": 3938, "img": "images/clarke.jpg", "info": "Jason Clarke stars in \"Zero Dark Thirty\" with Joel Edgerton and Jessia Chastain, and \"Lawless\" with Chastain. Through Edgerton he is connected to Jennifer Garner, Ben Afflect, John Goodman, Vince Vaughn and Will Ferrell, who star in \"Anchorman 2.\"", "imdb": "name/nm0164809"},
              {"name": "Jessica Chastain", "size": 3938, "img": "images/chastain.jpg", "info": "Jessica Chastain, Joel Edgerton and Jason Clarke, who all appeared in \"Zero Dark Thirty,\" also all appeared in metro Atlanta-made \"Lawless.\" Through Edgerton she is connected to Jennifer Garner, Ben Afflect, John Goodman, Vince Vaughn and Will Ferrell, who star in \"Anchorman 2.\"", "imdb": "name/nm1567113"},  

    {"name": "Paul Rudd", "img": "images/rudd.jpg", "info": "Paul Rudd stars in \"Anchorman 2\" as well as \"Wanderlust\" with Jennifer Aniston.", "imdb": "name/nm0748620"},
      {"name": "Jennifer Aniston", "size": 3938, "img": "images/aniston.jpg", "info": "Jennifer Aniston appeared in \"Wanderlust\" with Paul Rudd, who also appeared in \"Anchorman 2.\"", "imdb": "name/nm0000098"}, 
    {"name": "Kanye West", "img": "images/west.jpg", "info": "Kanye West accompanied Kim Kardashian to Atlanta for a red-carpet screening of \"Temptation: Confession of a Marriage Counselor,\" and was back a few months later for a role in \"Anchorman 2.\"", "imdb": "name/nm1577190"},
    {"name": "Kim Kardashian", "img": "images/kardashian.jpg", "info": "Kim Kardashian landed a small but headline-grabbing role in \"Temptation: Confessions of a Marriage Counselor.\" She also has appeared in a guest-role capacity in \"Drop Dead Diva,\" the Lifetime series that films here. She is also linked to Kanye West who appears in \"Anchorman 2.\"", "imdb": "name/nm2578007"},
      {"name": "Tyler Perry", "img": "images/perry.jpg", "info": "Along with Perry's popular \"Madea\" plays and movies, he's the creative force behind a number of television series and movies including \"Good Deeds,\" \"Why Did I Get Married\" and \"Why Did I Get Married Too,\" \"For Colored Girls\" and \"Temptation: Confessions of a Marriage Counselor.\" He is connected to \"Anchorman 2\" through Kim Kardashian, who is linked to Kanye West who appears in \"Anchorman 2.\"", "imdb": "name/nm1347153"},
    
    
    
    {"name": "Clint Eastwood", "img": "images/eastwood.jpg", "info": "Clint Eastwood appeared in \"Trouble with the Curve,\" which also stars John Goodman. He is linked to \"Anchorman 2\" through Goodman, who had a role in \"The Internship\" starring Vince Vaugh and Will Ferrell, who both also appeared in \"Anchorman 2.\"", "imdb": "name/nm0000142"},
    {"name": "Justin Timberlake", "img": "images/timberlake.jpg", "info": "Jason Timberlake appeared in \"Trouble with the Curve,\" which also stars John Goodman. He is linked to \"Anchorman 2\" through Goodman, who had a role in \"The Internship\" starring Vince Vaugh and Will Ferrell, who both also appeared in \"Anchorman 2.\"", "imdb": "name/nm0005493"},
    {"name": "Amy Adams", "img": "images/adams.jpg", "info": "Amy Adams appeared in \"Trouble with the Curve,\" which also stars John Goodman. He is linked to \"Anchorman 2\" through Goodman, who had a role in \"The Internship\" starring Vince Vaugh and Will Ferrell, who both also appeared in \"Anchorman 2.\"", "imdb": "name/nm0010736"},
    
    {"name": "Kristen Wiig", "img": "images/wiig.jpg", "info": "Kristen Wiig appeared in \"Anchorman 2.\" Her \"Bridesmaids\" co-star Melissa McCarthy appeared in \"Identity Thief.\"", "imdb": "name/nm1325419"},
      {"name": "Melissa McCarthy", "img": "images/mccarthy.jpg", "info": "Melissa McCarthy stars in Georgia filmed \"Identity Theif,\" as well as \"Bridesmaids\" with Kristen Wiig. She is connected to \"Anchorman 2\" through Kristen Wiig. ", "imdb": "name/nm0565250"},
        {"name": "Jason Bateman", "img": "images/bateman.jpg", "info": "Jason Bateman appeared in \"Identity Thief\" with Melissa McCarthy and \"The Change-Up\" with Ryan Reynolds. He is connected to \"Anchorman 2\" by his link with Melissa McCarthy, who is linked to Kristen Wiig.", "imdb": "name/nm0000867"},
          {"name": "Ryan Reynolds", "img": "images/reynolds.jpg", "info": "Ryan Reynolds starred in \"The Change-Up\" with Olivia Wilde and Jason Bateman. Through his link with Olivia Wilde, he is connected to Jim Carrey and Steve Carrell, who both star in \"Anchorman 2.\"", "imdb": "name/nm0005351"},
    
    {"name": "Will Ferrell", "img": "images/ferrell.jpg", "info": "Will Ferrell, star of \"Anchorman 2,\" also appeared in a small role in \"The Internship\" with Owen Wilson and Vince Vaughn.", "imdb": "name/nm0002071"},
      {"name": "Christina Applegate", "img": "images/applegate.jpg", "info": "Christina Applegate appeared in \"Hall Pass\" and \"Anchorman 2.\"", "imdb": "name/nm0000775"},
      {"name": "Jenna Fischer", "img": "images/fischer.jpg", "info": "Jenna Fischer appeared in \"Hall Pass\" with Christina Applegate who appeared in \"Anchorman 2.\"", "imdb": "name/nm0278979"},
    
    {"name": "Olivia Wilde", "img": "images/wilde.jpg", "info": "Olivia Wilde appeared in \"The Change-Up\" with Jason Bateman and Ryan Reynolds as well as \"The Incredible Burt Wonderstone\" with Jim Carrey and Steve Carell. Carrey and Carell both had roles in \"Anchorman 2.\"", "imdb": "name/nm1312575"},
    
    {"name": "Steve Carell", "img": "images/carell.jpg", "info": "Steve Carrell appeared in \"Anchorman 2.\" He also starred in \"The Incredible Burt Wonderstone\" with Olivia Wilde and Jim Carrey.", "imdb": "name/nm0136797"},
    {"name": "Jim Carrey", "img": "images/carrey.jpg", "info": "Jim Carrey appeared in \"Anchorman 2\" and will return for the sequel of \"Dumb and Dumber.\" He also starred in \"The Incredible Burt Wonderstone\" with Olivia Wilde and Steve Carell.", "imdb": "name/nm0000120"},
    {"name": "The Incredible Burt Wonderstone", "img": "images/clapboardRed.png", "info": "\"The Incredible Burt Wonderstone\" was not filmed in Georgia, but unites Steve Carell, Olivia Wilde and Jim Carrey, who were all recently in Georgia filming movies. The film opened earlier this year.", "imdb": "title/tt0790628"},
    {"name": "Zero Dark Thirty", "img": "images/clapboardRed.png", "info": "\"Zero Dark Thirty\" was not filmed in Georgia, but connects actors who have filmed movies in Georgia recently. Joel Edgerton, Jason Clarke, and Jessica Chastain all star in Zero Dark Thrity. The film connects Joel Edgerton, who was recently in Georgia filming \"The Odd Life of Timothy Green,\" to Jessica Chastain and Jason Clarke, who recently filmed \"Lawless\" in Georgia.", "imdb": "title/tt1790885"}
    

  ],
  "links":[
    {"source":13,"target":0,"value":140},
    {"source":13,"target":1,"value":140},
    {"source":13,"target":3,"value":140},
    
    {"source":14,"target":1,"value":140},
    
    {"source":15,"target":1,"value":140},
    
    {"source":16,"target":1,"value":140},
    
    {"source":17,"target":3,"value":140},
    {"source":17,"target":12,"value":140},
    
    {"source":18,"target":3,"value":140},
    {"source":18,"target":5,"value":140},
    {"source":18,"target":8,"value":140},
    
    {"source":19,"target":20,"value":140},
    {"source":19,"target":5,"value":140},
    
    {"source":20,"target":6,"value":140},
    
    {"source":21,"target":6,"value":140},
    {"source":21,"target":43,"value":140},
    
    {"source":22,"target":7,"value":140},
    {"source":22,"target":43,"value":140},
    
    {"source":23,"target":7,"value":140},
    {"source":23,"target":43,"value":140},
    
    {"source":24,"target":0,"value":140},
    {"source":24,"target":2,"value":140},
    
    {"source":25,"target":2,"value":140},
    
    {"source":26,"target":0,"value":140},
    {"source":26,"target":27,"value":140},
    
    {"source":27,"target":4,"value":140},
    
    {"source":28,"target":4,"value":140},
    
    {"source":29,"target":8,"value":140},
    
    {"source":30,"target":8,"value":140},
    
    {"source":31,"target":8,"value":140},
    
    {"source":32,"target":0,"value":140},
    {"source":32,"target":9,"value":140},
    
    {"source":33,"target":9,"value":140},
    {"source":33,"target":10,"value":140},
    
    {"source":34,"target":10,"value":140},
    {"source":34,"target":11,"value":140},
    
    {"source":35,"target":11,"value":140},
    
    {"source":36,"target":0,"value":140},
    {"source":36,"target":3,"value":140},
    
    {"source":37,"target":0,"value":140},
    {"source":37,"target":12,"value":140},
    
    {"source":38,"target":12,"value":140},
    
    {"source":39,"target":11,"value":140},
    {"source":39,"target":42,"value":140},
    
    {"source":40,"target":0,"value":140},
    {"source":40,"target":42,"value":140},
    
    {"source":41,"target":0,"value":140},
    {"source":41,"target":42,"value":140}

   
  ]
}